# Worries / Not sure / expectations

- Classes: going fast
- worried about the labs 
- labs I dont feel like im learning
- datasets? projects...

CONTENT
- Fast-paced: catch up / concatenated
- More intense than expected
- No time
- Too fast -> can't REMEMBER
- Moving forward: things built on top of each oterh (previous)
- Python? SQL?


LABS
- Katas: good for reviewm, buuuuut
- too much time for labs
- unfinished labs
- 100%, 100%: 
    - 100% of yourself

PROJECTS
    - project: EDA: exploratory data analysis
    - .csv file -> table, "dirty" data is not clean
    - 4 categories -> 
        - "furniture"
        - "furnitures"
        - "chairs and stuff"
        - What's the percentage of furnitre sold in this region?

LEARNING IN GENERAL - Roller coaster
TIME
   - checking the feedback
   - feedack: projects
   
- lab vs recap: time? 

- FAST
    - Don't worry about rememering things
    - Feeling: "I feel like I'm not retaining" "not learning"
    - Overtime: "click" moment
    
- Best practices
- No positive feedback?

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Introduction-to-pandas-data-structures" data-toc-modified-id="Introduction-to-pandas-data-structures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introduction to pandas data structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Dataframes" data-toc-modified-id="Dataframes-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Dataframes</a></span><ul class="toc-item"><li><span><a href="#From-data-types" data-toc-modified-id="From-data-types-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>From data types</a></span></li><li><span><a href="#From-path" data-toc-modified-id="From-path-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>From path</a></span></li><li><span><a href="#From-databases" data-toc-modified-id="From-databases-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>From databases</a></span></li></ul></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Exploratory-analysis-of-a-dataframe-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Exploratory analysis of a dataframe</a></span><ul class="toc-item"><li><span><a href="#Meta-information" data-toc-modified-id="Meta-information-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Meta information</a></span></li><li><span><a href="#Previsualization" data-toc-modified-id="Previsualization-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Previsualization</a></span></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Order a dataframe</a></span></li><li><span><a href="#NaN-values" data-toc-modified-id="NaN-values-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>NaN values</a></span></li><li><span><a href="#Basic-descriptive-statistics" data-toc-modified-id="Basic-descriptive-statistics-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Basic descriptive statistics</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

#Â Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

## Introduction
Pandas is undoubtedly the most widely used library in the Python ecosystem for data manipulation and analysis. It's fast, powerful, flexible, easy to use and open source.


Among its main features:

- A fast and efficient **DataFrame** object for data manipulation with built-in indexing* 

- **Reading and writing** of data in many formats: Microsoft Excel, CSV, SQL databases, etc;

- Integrated and efficient methods for all types of data manipulation: missing data, subset, union, merge, etc;

- Ease of working with temporary data (in fact, Pandas is named after "PANnel DAta")

- Good **integration with other data analysis or Machine learning libraries**: scikit-learn, scipy, seaborn, plotly, etc;

- It is **widely used** in both the private and academic sectors


Pandas provides high-level data structures and functions designed to make working with structured or tabular data fast, easy, and expressive. Since its introduction in 2010, it has helped make Python a powerful and productive data analysis environment. The main pandas objects that will be used in this book are the DataFrame, a column-oriented tabular data structure with row and column labels, and the Series, a labeled one-dimensional array object.

Pandas combines the high performance ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides sophisticated indexing functionality to make it easy to reshape, slice and dice, perform aggregations, and select subsets of data.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Source: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Installation

The first thing you should do will always be
`pip install pandas`, `conda install pandas`

In [1]:
#Â anaconda
    # enviroments: ironhack
    #pandas
    
#Â miniconda
    #Â conda activate ironhack
    #pip install pandas

In [4]:
import pandas as pd
import numpy as np

## Introduction to pandas data structures
To get started with pandas, you'll need to get comfortable with its two working data structures: Series and DataFrame. Although they are not a universal solution to all problems, they provide a solid and easy-to-use foundation for most applications.

In [ ]:
#Â pd
#Â DataFrame: tables
    #Â Series: column / row

### Series
A Serie is a one-dimensional array object containing a sequence of values â€‹â€‹(of NumPy-like types) and an associated array of data labels, called its index. The simplest Series is formed from a single array of data:

In [28]:
series_ = pd.Series([1, 2, 3, "sdsd", 34534])

In [29]:
series_ 

#dtype: object, umbrella term for type of object
#dtype: str

0        1
1        2
2        3
3     sdsd
4    34534
dtype: object

In [31]:
series_.index

for i in series_.index:
    print(i)

0
1
2
3
4

In [ ]:
# T
#Â transpose
#Â similar methods to numpy

In [ ]:
# Index that is not just numbers: 
    #Â List of IDs may be index
    # Dates

In [11]:
series_.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
#[i for i in dir(series_) if "_" not in i]

The string representation of a Series displayed interactively shows the index on the left and the values â€‹â€‹on the right. Since we didn't specify an index for the data, a default one consisting of the integers 0 to N - 1 (where N is the length of the data) is created. You can get the array representation and the index object of the Series through its values â€‹â€‹and index attributes, respectively:

Another way to think of a Series is as a fixed-length ordered dict, since it is a mapping of index values â€‹â€‹to data values. It can be used in many contexts where a dictionary could be used.
If you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [12]:
some_data = {
    "Ohio": 87654,
    "Texas": 678,
    "Oregon": 6789,
    "Utah": 5678,
    "something_else": 567
}

In [13]:
my_series = pd.Series(some_data) #class Series(something: dict)
my_series

Ohio              87654
Texas               678
Oregon             6789
Utah               5678
something_else      567
dtype: int64

In [ ]:
# Keys of the dict: became the index
#Â Values: values

In [14]:
my_series.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah', 'something_else'], dtype='object')

In [15]:
my_series.values

array([87654,   678,  6789,  5678,   567])

In [ ]:
#Â can two methods have the same name?
#Â a: no

When only one dict is passed, the resulting String index will have the keys of the dict in order. You can override this by passing the keys of the dict in the order you want them to appear in the resulting String:

In [25]:
#Â class Series ():
    #def __init__(self, data, index):
    
#Â 1. The data    
some_data = {
    "Ohio": 87654,
    "Texas": 678,
    "Oregon": 6789,
    "Utah": 5678,
    "something_else": 567
}


#Â 2. Overwriting the index
states = ["Ohio", "Texas", "oregÃ³n", "Utah", "California"]

#Â 3. Instantiating the series: Index will become the states list

my_series = pd.Series(data = some_data, index = states)

In [27]:
my_series.index

Index(['Ohio', 'Texas', 'oregÃ³n', 'Utah', 'California'], dtype='object')

In [26]:
my_series #Â In the index corresponding to California, no value -> NaN

#Â NaN: Not a Number, missing value, empty / null

Ohio          87654.0
Texas           678.0
oregÃ³n            NaN
Utah           5678.0
California        NaN
dtype: float64

In [ ]:
#Â Pandas
    #Â 1. Series
        #Â 1.1. Index: can be overwritten
        #Â 1.2. Values: values
        
    #Â 2. Dataframes
       #Â Vertical series
        #Â horizontal series

Here, the three values â€‹â€‹found in sdata were placed in the appropriate places, but since no value was found for 'California', it appears as NaN (not a number), which is considered in pandas to mark missing values â€‹â€‹or NA. Since "Utah" was not included in the states, it is excluded from the resulting object.

### Dataframes
Pandas can read and write data from a wide variety of formats. [Read the documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Although one of the most common is from a dict of lists of equal length or NumPy arrays:

#### From data types

`from dictionaries with lists as values`

In [35]:
dictionary_with_lists_as_values = {
    "state": ["California", "New york", "Utah", "Oregon"],
    "year": [2023, 1809, 2008, 1900],
    "something_else": ["Great", "Crowded", "?", "??"]
}

In [36]:
df = pd.DataFrame(dictionary_with_lists_as_values)
df

        state  year something_else
0  California  2023          Great
1    New york  1809        Crowded
2        Utah  2008              ?
3      Oregon  1900             ??

In [41]:
import numpy as np

dictionary_with_lists_as_values = {
    "state": ["California", "New york", "Utah", np.NaN], # one less element
    "year": [2023, 1809, 2008, 1900],
    "something_else": ["Great", "Crowded", "?", "??"]
}

#Â Error 
#Â NaN in Oregon
# One less row


#Â ValueError: All arrays must be of the same length
pd.DataFrame(dictionary_with_lists_as_values)

        state  year something_else
0  California  2023          Great
1    New york  1809        Crowded
2        Utah  2008              ?
3         NaN  1900             ??

In [39]:
dictionary_with_lists_as_values = {
    "state": ["California", "New york", "Utah"], # one less element
    "year": [2023, 1809, 2008, 1900],
    "something_else": ["Great", "Crowded", "?", "??"]
}

#Â Error 
#Â NaN in Oregon
# One less row


#Â ValueError: All arrays must be of the same length
#Â df = pd.DataFrame(dictionary_with_lists_as_values)

Since we are using Jupyter Notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table. [More info on this](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html)

`from list of dictionaries`

If I create a dataframe through a list of dictionaries:
- Each dictionary will be a row
- The keys will be the names of the columns
- They have to have the same structure

In [50]:
# state
# year
# something else

list_of_dictionaries = [  #Â total #Â of keys: 3 for all
    {"state": "CA", "year": 2023, "something_else": "question mark"},
    {"state": "NY", "year": 1900, "something_else": "ðŸ˜€"},
    {"state": "OR", "year": 2008, "something_else": "Random word"},
    {"states": "UT", "year": 1901, "something_else": "Building my first df"},
    {"states": "UT", "year": 1901, "something_else": "Building my first df"},
    {"states": "UT", "year": 1901, "something_else": "Building my first df"}

]

df = pd.DataFrame(list_of_dictionaries)
df

  state  year        something_else states
0    CA  2023         question mark    NaN
1    NY  1900                     ðŸ˜€    NaN
2    OR  2008           Random word    NaN
3   NaN  1901  Building my first df     UT
4   NaN  1901  Building my first df     UT
5   NaN  1901  Building my first df     UT

In [52]:
#[i for i in dir(df) if "_" not in i]

In [55]:
#Â q: Make the idnex start at 1

#Â Class DataFrame ()
    #Â Naming conventions: class are capitalized
#Â Methods
#Â Attribues
    #Â Index: attribute

df.index = range(1,7,1)

#Â Attributes of instances can be overwritten

In [ ]:
class DataFrame(): 
    def __init__(data, index=None):
        self.data = data
        self.index = index
        
    def drop_columns ():
        pass
    
df = pd.DataFrame(dictionary_with_lists)
df.index # range(0, 6)
df.index = range(10, 17)

#Â overwriting the attribute of an instance I created
#Â from the class DataFrame

#Â saxon.health -= 30
#Â overwriting the atribute of the instance im working with

[i for i in dir(df) if "_" not in i] #Â attributes and methods

In [56]:
df

  state  year        something_else states
1    CA  2023         question mark    NaN
2    NY  1900                     ðŸ˜€    NaN
3    OR  2008           Random word    NaN
4   NaN  1901  Building my first df     UT
5   NaN  1901  Building my first df     UT
6   NaN  1901  Building my first df     UT

[pandas from dict](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.from_dict.html)

#### From path

`.csv`

In [ ]:
#Â sep
#Â csv stands for: comma separated values

In [65]:
df = pd.read_csv("../datasets/avocado_kaggle.csv") #Â encoding
df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

`.xlsx`, `xls`, `xlsm`, `xlsb`, `odf`, `ods`, `odt`

In [37]:
#df_from_excel = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl", nrows=5)
#df_from_excel.head()

`Reading different sheeets`

In [38]:
# Default tab (first one)

#df_from_excel_new_tab = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl", nrows=5)
#df_from_excel_new_tab.head()

In [39]:
# Other tab: (new_tab)
#df_from_excel_new_tab = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl", "new_tab", nrows=5)
#df_from_excel_new_tab.head()

`web`: https://raw.githubusercontent.com/datapackage-examples/sample-csv/master/sample.csv

In [67]:
df = pd.read_csv("https://raw.githubusercontent.com/datapackage-examples/sample-csv/master/sample.csv")
df

,header 0,header 1,header 2,header 3,header 4,header 5,header 6,header 7,header 8,header 9
0,row 1 col 0,row 1 col 1,row 1 col 2,row 1 col 3,row 1 col 4,row 1 col 5,row 1 col 6,row 1 col 7,row 1 col 8,row 1 col 9
1,row 2 col 0,row 2 col 1,row 2 col 2,row 2 col 3,row 2 col 4,row 2 col 5,row 2 col 6,row 2 col 7,row 2 col 8,row 2 col 9
2,row 3 col 0,row 3 col 1,row 3 col 2,row 3 col 3,row 3 col 4,row 3 col 5,row 3 col 6,row 3 col 7,row 3 col 8,row 3 col 9
3,row 4 col 0,row 4 col 1,row 4 col 2,row 4 col 3,row 4 col 4,row 4 col 5,row 4 col 6,row 4 col 7,row 4 col 8,row 4 col 9
4,row 5 col 0,row 5 col 1,row 5 col 2,row 5 col 3,row 5 col 4,row 5 col 5,row 5 col 6,row 5 col 7,row 5 col 8,row 5 col 9
5,row 6 col 0,row 6 col 1,row 6 col 2,row 6 col 3,row 6 col 4,row 6 col 5,row 6 col 6,row 6 col 7,row 6 col 8,row 6 col 9
6,row 7 col 0,row 7 col 1,row 7 col 2,row 7 col 3,row 7 col 4,row 7 col 5,row 7 col 6,row 7 col 7,row 7 col 8,row 7 col 9
7,row 8 col 0,row 8 col 1,row 8 col 2,row 8 col 3,row 8 col 4,row 8 col 5,row 8 col 6,row 8 col 7,row 8 col 8,row 8 col 9
8,row 9 col 0,row 9 col 1,row 9 col 2,row 9 col 3,row 9 col 4,row 9 col 5,row 9 col 6,row 9 col 7,row 9 col 8,row 9 col 9
9,row 10 col 0,row 10 col 1,row 10 col 2,row 10 col 3,row 10 col 4,row 10 col 5,row 10 col 6,row 10 col 7,row 10 col 8,row 10 col 9

In [68]:
!curl "https://raw.githubusercontent.com/Ironhack-data-bcn-oct-2023/lectures/main/datasets/avocado_kaggle.csv" > example.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 1942k  100 1942k    0     0  1095k      0  0:00:01  0:00:01 --:--:-- 1101k

In [ ]:
! open example.csv

#### From databases

`sql`: [docs](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html)

```python
from sqlite3 import connect

conn = connect(':memory:')
df = pd.read_sql('SELECT column_1, column_2 FROM sample_data', conn)

df.to_sql('test_data', conn)
```

`mongodb`

```python
import pymongo
from pymongo import MongoClient

client = MongoClient()
db = client.database_name
collection = db.collection_name
data = pd.DataFrame(list(collection.find()))
```

## Exploratory analysis of a dataframe

In [71]:
df = pd.read_csv("../datasets/Advertising.csv")
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [73]:
df.shape #Â attribute

(200, 4)

In [76]:
#Â How many rows does a df have?

rows, columns = df.shape
columns

4

In [77]:
df.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [78]:
list(df.columns)

['TV', 'Radio', 'Newspaper', 'Sales']

### Meta information

`shape, columns, dtypes, info, describe`

In [85]:
#Â comprehension list

df.columns = [i.upper().replace("A", "a") for i in df.columns]
df

        RV  RaDIO  NEWSPaPER  SaLES
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [82]:
df.columns = ["rv", "radio", "newspaper", "sales"]
df
#Â attributes can be overwritten

        rv  radio  newspaper  sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [112]:
df.head(3)

      RV  RaDIO  NEWSPaPER  SaLES
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3

In [118]:
df.sample(3)

        RV  RaDIO  NEWSPaPER  SaLES
144   96.2   14.8       38.9   11.4
182   56.2    5.7       29.7    8.7
150  280.7   13.9       37.0   16.1

In [88]:
df.head(7) #Â first five rows (in bash --head --tail)

      RV  RaDIO  NEWSPaPER  SaLES
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9
5    8.7   48.9       75.0    7.2
6   57.5   32.8       23.5   11.8

In [120]:
df.sample()

       RV  RaDIO  NEWSPaPER  SaLES
59  210.7   29.5        9.3   18.4

In [119]:
df.describe() # numerical columns

#Â std: standard deviation
#Â percentages:  quartiles / quantiles / ...
    #Â 25%
    #Â 50%
    #Â 75% 
    #Â centile 90: 
        #Â score on a test, I have X score, and my centile is 90
            #Â my score is on the top 10%
            # 73/100, centile is 90%
                #Â I scored higher than 90% of the class
                #Â 90% of the student scored less than 73
    #Â proportion of values BELOW that value
    
#Â linea de crecimiento
    #Â percentil 
    
#Â understand relatively your data: how one value relates to the rest of the dataset

               RV       RaDIO   NEWSPaPER       SaLES
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [121]:
#Â info about the info (meta-info)

df.info() #Â  float64 memory

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   RV         200 non-null    float64
 1   RaDIO      200 non-null    float64
 2   NEWSPaPER  200 non-null    float64
 3   SaLES      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [ ]:
#head, info, describe, shape, columns, ... -> meta-information

[How dtypes work](https://numpy.org/doc/stable/reference/arrays.dtypes.html)

### Previsualization

`head`

In [ ]:
df.head()

In [ ]:
df.head(3)

By default head shows me the first 5 rows, I can see some more or less by passing a number as a parameter

`tail`

In [ ]:
df.tail()

In [ ]:
df.tail(3)

### Order a dataframe

In [123]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [129]:
"""
my_array = np.array(["string", "hello", "hi"])
my_array[0]
"""

'\nmy_array = np.array(["string", "hello", "hi"])\nmy_array[0]\n'

In [130]:
max_price = df["AveragePrice"].max() #Â what's the row?
max_price

3.25

In [137]:
# Q: What if I want to get the row corresponding to the max value

df["AveragePrice"][df["AveragePrice"] == max_price].index

Index([14125], dtype='int64')

In [145]:
# What if I want to see another column based on the condition of another one

df[df["AveragePrice"] == max_price][["Total Bags"]]

       Total Bags
14125     3232.16

In [139]:
df["Total Bags"].max()

19373134.37

In [125]:
df.sort_values(by = "AveragePrice", ascending=False)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
14125,8,2016-10-30,3.25,16700.94,2325.93,11142.85,0.00,3232.16,3232.16,0.00,0.00,organic,2016,SanFrancisco
17428,37,2017-04-16,3.17,3018.56,1255.55,82.31,0.00,1680.70,1542.22,138.48,0.00,organic,2017,Tampa
14124,7,2016-11-06,3.12,19043.80,5898.49,10039.34,0.00,3105.97,3079.30,26.67,0.00,organic,2016,SanFrancisco
16055,42,2017-03-12,3.05,2068.26,1043.83,77.36,0.00,947.07,926.67,20.40,0.00,organic,2017,MiamiFtLauderdale
16720,18,2017-08-27,3.04,12656.32,419.06,4851.90,145.09,7240.27,6960.97,279.30,0.00,organic,2017,RaleighGreensboro
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1716,0,2015-12-27,0.49,1137707.43,738314.80,286858.37,11642.46,100891.80,70749.02,30142.78,0.00,conventional,2015,PhoenixTucson
15262,44,2017-02-26,0.49,44024.03,252.79,4472.68,0.00,39298.56,600.00,38698.56,0.00,organic,2017,CincinnatiDayton
15473,43,2017-03-05,0.48,50890.73,717.57,4138.84,0.00,46034.32,1385.06,44649.26,0.00,organic,2017,Detroit
7412,47,2017-02-05,0.46,2200550.27,1200632.86,531226.65,18324.93,450365.83,113752.17,330583.10,6030.56,conventional,2017,PhoenixTucson
15261,43,2017-03-05,0.44,64057.04,223.84,4748.88,0.00,59084.32,638.68,58445.64,0.00,organic,2017,CincinnatiDayton

In [147]:
df.sort_values(by = ["AveragePrice", "year"], ascending=False).head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
14125,8,2016-10-30,3.25,16700.94,2325.93,11142.85,0.00,3232.16,3232.16,0.00,0.0,organic,2016,SanFrancisco
17428,37,2017-04-16,3.17,3018.56,1255.55,82.31,0.00,1680.70,1542.22,138.48,0.0,organic,2017,Tampa
14124,7,2016-11-06,3.12,19043.80,5898.49,10039.34,0.00,3105.97,3079.30,26.67,0.0,organic,2016,SanFrancisco
16055,42,2017-03-12,3.05,2068.26,1043.83,77.36,0.00,947.07,926.67,20.40,0.0,organic,2017,MiamiFtLauderdale
16720,18,2017-08-27,3.04,12656.32,419.06,4851.90,145.09,7240.27,6960.97,279.30,0.0,organic,2017,RaleighGreensboro

In [152]:
df.sort_values(by = ["year", "AveragePrice"], ascending=(False, True)).head(15)
#Â By passing a tuple of booleans
#Â DOCSSSSSSS
#Â  ascending: 'bool | list[bool] | tuple[bool, ...]' = True,

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
8694,0,2018-03-25,0.56,2120511.03,837700.97,162473.38,4190.48,1116146.20,952254.70,161188.17,2703.33,conventional,2018,Houston
8701,7,2018-02-04,0.56,2381742.59,952746.89,300383.28,7990.32,1120622.10,1010539.42,109978.24,104.44,conventional,2018,Houston
8700,6,2018-02-11,0.58,1870874.72,801390.67,156458.96,4407.32,908617.77,747968.17,160355.16,294.44,conventional,2018,Houston
8876,2,2018-03-11,0.58,1619549.79,941189.25,269078.43,14057.17,395224.94,227505.97,161870.08,5848.89,conventional,2018,PhoenixTucson
8874,0,2018-03-25,0.59,1684537.69,932956.86,296968.67,14886.96,439725.20,216076.58,218329.73,5318.89,conventional,2018,PhoenixTucson
8879,5,2018-02-18,0.59,1544983.15,923293.00,242108.74,12876.81,366704.60,228817.23,131177.62,6709.75,conventional,2018,PhoenixTucson
8881,7,2018-02-04,0.59,1998260.47,1029017.42,511201.78,13917.11,444124.16,236056.82,202720.67,5346.67,conventional,2018,PhoenixTucson
8877,3,2018-03-04,0.61,1672899.36,962967.90,268082.25,12934.88,428914.33,266658.69,156802.31,5453.33,conventional,2018,PhoenixTucson
8880,6,2018-02-11,0.64,1490711.97,793896.21,256987.03,12607.40,427221.33,241681.63,179607.48,5932.22,conventional,2018,PhoenixTucson
9025,7,2018-02-04,0.65,10323174.59,4772921.95,1623613.82,38521.35,3888117.47,3351508.25,508738.57,27870.65,conventional,2018,SouthCentral
8617,7,2018-02-04,0.67,1885401.44,855815.37,340887.07,6655.47,682043.53,583353.20,86725.24,11965.09,conventional,2018,DallasFtWorth
8641,7,2018-02-04,0.67,880540.45,167512.70,287359.89,60027.97,365639.89,266930.49,89516.48,9192.92,conventional,2018,Detroit
8698,4,2018-02-25,0.67,1657524.28,855570.87,147837.21,3976.08,650140.12,544537.00,105365.34,237.78,conventional,2018,Houston
8699,5,2018-02-18,0.68,1572064.61,931553.80,160780.41,4045.42,475684.98,372117.42,103276.45,291.11,conventional,2018,Houston
8882,8,2018-01-28,0.68,1592137.30,902410.41,288508.97,12312.08,388905.84,235248.48,147958.47,5698.89,conventional,2018,PhoenixTucson

Same operation, but give me only concrete columns

In [155]:
df.sort_values(by = ["year", "AveragePrice"], ascending=(False, True))
#Â year & averageprice


df.sort_values(by = ["year", "AveragePrice"], ascending=(False, True))[["year", "AveragePrice"]]

       year  AveragePrice
8694   2018          0.56
8701   2018          0.56
8700   2018          0.58
8876   2018          0.58
8874   2018          0.59
...     ...           ...
11332  2015          2.75
11331  2015          2.76
11327  2015          2.77
11320  2015          2.79
11324  2015          2.79

[18249 rows x 2 columns]

In [ ]:
df["cosdsdsdsd"] #Â -> series
df[["cosdsdsdsd"]]Â #Â -> DataFrame


np.array([]) #Â 
np.array([[]]) # 2d Â

In [159]:
type(df["Date"])

pandas.core.series.Series

In [160]:
type(df[["Date"]])

pandas.core.frame.DataFrame

In [ ]:
#Â To create a subset: df[list_of_things]
#Â df[[]]


#Â To get the series: df[serie]

`sample`

`display`

### NaN values
NaN stands for Not A Number and is one of the common ways to represent the missing value in the data. It is a special floating point value and cannot be converted to a type other than float.
The NaN value is one of the main problems in data analysis. It is very essential to deal with NaN to get the desired results.

In [161]:
#Â NaN: not a number

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Total Bags    18249 non-null  float64
 8   Small Bags    18249 non-null  float64
 9   Large Bags    18249 non-null  float64
 10  XLarge Bags   18249 non-null  float64
 11  type          18249 non-null  object
 12  year          18249 non-null  int64
 13  region        18249 non-null  object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

In [ ]:
# loop through the rows:
    #Â counter
    #Â  == NaN

In [167]:
df.isnull().sum()

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

In [163]:
df.isnull().sum() #Â False -> 0, True -> 1

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

In [ ]:
#Â True: 1, NaN
#Â The Trues are missng vlaues
#Â You want it to be zero

In [169]:
pd.isna(df).sum()

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

###  Basic descriptive statistics

In [171]:
df[["type"]] 

# string: data type
# type of variable?
    # quantitative
    # qualitative (categorical)

               type
0      conventional
1      conventional
2      conventional
3      conventional
4      conventional
...             ...
18244       organic
18245       organic
18246       organic
18247       organic
18248       organic

[18249 rows x 1 columns]

In [ ]:
#Â Categories of type column?

#Â count
#Â looping those & printing those that are diufferent
#Â set
# method

In [174]:
set(df["type"].values)

{'conventional', 'organic'}

In [176]:
df["region"].value_counts()

region
Albany                 338
Sacramento             338
Northeast              338
NorthernNewEngland     338
Orlando                338
Philadelphia           338
PhoenixTucson          338
Pittsburgh             338
Plains                 338
Portland               338
RaleighGreensboro      338
RichmondNorfolk        338
Roanoke                338
SanDiego               338
Atlanta                338
SanFrancisco           338
Seattle                338
SouthCarolina          338
SouthCentral           338
Southeast              338
Spokane                338
StLouis                338
Syracuse               338
Tampa                  338
TotalUS                338
West                   338
NewYork                338
NewOrleansMobile       338
Nashville              338
Midsouth               338
BaltimoreWashington    338
Boise                  338
Boston                 338
BuffaloRochester       338
California             338
Charlotte              338
Chicago                338
CincinnatiDayton       338
Columbus               338
DallasFtWorth          338
Denver                 338
Detroit                338
GrandRapids            338
GreatLakes             338
HarrisburgScranton     338
HartfordSpringfield    338
Houston                338
Indianapolis           338
Jacksonville           338
LasVegas               338
LosAngeles             338
Louisville             338
MiamiFtLauderdale      338
WestTexNewMexico       335
Name: count, dtype: int64

In [177]:
df["type"].unique() #Â not how many

array(['conventional', 'organic'], dtype=object)

In [175]:
df["type"].value_counts()

type
conventional    9126
organic         9123
Name: count, dtype: int64

In [185]:
df["year"] #Â same
df.year # same

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
18244    2018
18245    2018
18246    2018
18247    2018
18248    2018
Name: year, Length: 18249, dtype: int64

In [189]:
#df.Unnamed: 0

In [179]:
df[df["year"] > 2016]

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
5616,0,2017-12-31,1.47,113514.42,2622.70,101135.53,20.25,9735.94,5556.98,4178.96,0.0,conventional,2017,Albany
5617,1,2017-12-24,1.45,77039.09,2811.71,58592.23,19.06,15616.09,6863.18,8752.91,0.0,conventional,2017,Albany
5618,2,2017-12-17,1.43,70677.56,2578.95,50811.52,79.18,17207.91,8914.13,8293.78,0.0,conventional,2017,Albany
5619,3,2017-12-10,1.29,92325.53,3220.05,75147.56,104.36,13853.56,7268.21,6585.35,0.0,conventional,2017,Albany
5620,4,2017-12-03,1.39,139970.00,3772.00,126551.00,136.00,9511.00,7061.00,2450.00,0.0,conventional,2017,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [178]:
df[df["region"] == "Albany"]
#Â my_array[value == 100]

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17608,7,2018-02-04,1.52,4124.96,118.38,420.36,0.00,3586.22,3586.22,0.00,0.0,organic,2018,Albany
17609,8,2018-01-28,1.32,6987.56,433.66,374.96,0.00,6178.94,6178.94,0.00,0.0,organic,2018,Albany
17610,9,2018-01-21,1.54,3346.54,14.67,253.01,0.00,3078.86,3078.86,0.00,0.0,organic,2018,Albany
17611,10,2018-01-14,1.47,4140.95,7.30,301.87,0.00,3831.78,3831.78,0.00,0.0,organic,2018,Albany
17612,11,2018-01-07,1.54,4816.90,43.51,412.17,0.00,4361.22,4357.89,3.33,0.0,organic,2018,Albany

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values â€‹â€‹of a column
df.col.unique() # returns unique values â€‹â€‹from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)